_posts/2016-03-29-tar-how-to-rename.html
---
layout : post
title : tar how to rename
categories : Utils
tags : tar
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org999c6dc">1. Use -C and &#x2013;strip-components (See man tar).</a></li>
<li><a href="#org6022865">2. Use <code>--transform</code></a></li>
</ul>
</div>
</div>


<div id="outline-container-org999c6dc" class="outline-2">
<h2 id="org999c6dc"><span class="section-number-2">1</span> Use -C and &#x2013;strip-components (See man tar).</h2>
<div class="outline-text-2" id="text-1">
<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir FOLDER
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">for remote tar file</span>
curl -L &#8217;remote_tar_file<span style="color: #d78700;">' | tar -xz - -C FOLDER --strip-components=1</span>

<span style="color: #d78700;"># for local tar file</span>
<span style="color: #d78700;">tar -xz FILENAME -C FOLDER --strip-components=1</span>

</pre>
</div>
</div>
</div>


<div id="outline-container-org6022865" class="outline-2">
<h2 id="org6022865"><span class="section-number-2">2</span> Use <code>--transform</code></h2>
<div class="outline-text-2" id="text-2">
<p>
You can also use the &#x2013;transform option for a bit more flexibility. It accepts any sed replacement (s) operation.
</p>

<p>
For example, this is how I extract a Linux tarball to a new directory so I can apply a patch:
</p>

<div class="org-src-container">
<pre class="src src-sh">tar -xjf linux-2.6.38.tar.bz2 --transform <span style="color: #d78700;">'s/linux-2.6.38/linux-2.6.38.1/'</span>

</pre>
</div>
</div>
</div>
